{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "blackheads",
    "1": "dark_spot",
    "2": "nodules",
    "3": "papules",
    "4": "pustules",
    "5": "whiteheads"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "blackheads": "0",
    "dark_spot": "1",
    "nodules": "2",
    "papules": "3",
    "pustules": "4",
    "whiteheads": "5"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "multi_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.0.dev0"
}
