{
  "_name_or_path": "google/mobilenet_v1_1.0_224",
  "architectures": [
    "MobileNetV1ForImageClassification"
  ],
  "classifier_dropout_prob": 0.001,
  "depth_multiplier": 1.0,
  "hidden_act": "relu6",
  "id2label": {
    "0": "blackheads",
    "1": "dark_spot",
    "2": "nodules",
    "3": "papules",
    "4": "pustules",
    "5": "whiteheads"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "blackheads": "0",
    "dark_spot": "1",
    "nodules": "2",
    "papules": "3",
    "pustules": "4",
    "whiteheads": "5"
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v1",
  "num_channels": 3,
  "problem_type": "multi_label_classification",
  "tf_padding": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.0.dev0"
}
