{
  "_name_or_path": "google/siglip-base-patch16-224",
  "architectures": [
    "SiglipForImageClassification"
  ],
  "id2label": {
    "0": "blackheads",
    "1": "dark_spot",
    "2": "nodules",
    "3": "papules",
    "4": "pustules",
    "5": "whiteheads"
  },
  "initializer_factor": 1.0,
  "label2id": {
    "blackheads": "0",
    "dark_spot": "1",
    "nodules": "2",
    "papules": "3",
    "pustules": "4",
    "whiteheads": "5"
  },
  "model_type": "siglip",
  "problem_type": "multi_label_classification",
  "text_config": {
    "model_type": "siglip_text_model"
  },
  "torch_dtype": "float32",
  "transformers_version": "4.42.0.dev0",
  "vision_config": {
    "model_type": "siglip_vision_model"
  }
}
