{
  "_name_or_path": "facebook/convnextv2-tiny-1k-224",
  "architectures": [
    "ConvNextV2ForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "blackheads",
    "1": "dark_spot",
    "2": "nodules",
    "3": "papules",
    "4": "pustules",
    "5": "whiteheads"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "blackheads": "0",
    "dark_spot": "1",
    "nodules": "2",
    "papules": "3",
    "pustules": "4",
    "whiteheads": "5"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "convnextv2",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "multi_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.42.0.dev0"
}
